In [235]:
import pandas as pd

In [236]:
data={'이름':['메로나','비비빅','죠스바'],
      '가격':[300,400,250],
      '재고':[20,3,100]}
df=pd.DataFrame(data)
df

    이름   가격   재고
0  메로나  300   20
1  비비빅  400    3
2  죠스바  250  100

In [237]:
df.columns
df.loc[[0,1,2]]['가격']

0    300
1    400
2    250
Name: 가격, dtype: int64

In [238]:
print(df.loc[[0,1,2]]['이름'])
print(df.loc[[0,1,2]]['재고'])

0    메로나
1    비비빅
2    죠스바
Name: 이름, dtype: object
0     20
1      3
2    100
Name: 재고, dtype: int64

In [239]:
df.iloc[1][[1,2]]

C:\Users\KDP-26\AppData\Local\Temp\ipykernel_11428\2231021384.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[1][[1,2]]

가격    400
재고      3
Name: 1, dtype: object

In [240]:
print(df.iloc[0][[1,2]])
print(df.iloc[2][[1,2]])

가격    300
재고     20
Name: 0, dtype: object
가격    250
재고    100
Name: 2, dtype: object

C:\Users\KDP-26\AppData\Local\Temp\ipykernel_11428\3596757488.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(df.iloc[0][[1,2]])
C:\Users\KDP-26\AppData\Local\Temp\ipykernel_11428\3596757488.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(df.iloc[2][[1,2]])

In [241]:
df.index=['일','이','삼']
df

    이름   가격   재고
일  메로나  300   20
이  비비빅  400    3
삼  죠스바  250  100

In [242]:
df['총가격']=0
df

    이름   가격   재고  총가격
일  메로나  300   20    0
이  비비빅  400    3    0
삼  죠스바  250  100    0

In [243]:
df.loc['사']=['빵빠레',550,10,0]
df

    이름   가격   재고  총가격
일  메로나  300   20    0
이  비비빅  400    3    0
삼  죠스바  250  100    0
사  빵빠레  550   10    0

In [244]:
df.loc['이','재고']=23
df

    이름   가격   재고  총가격
일  메로나  300   20    0
이  비비빅  400   23    0
삼  죠스바  250  100    0
사  빵빠레  550   10    0

In [245]:
data2 = [
    [ 2000,  3050,  2050,  1980],
    [ 7500,  2050,  2050,  1980],
    [15450, 15050, 15550, 14900]
 ]

In [246]:
df2=pd.DataFrame(data2)
df2

       0      1      2      3
0   2000   3050   2050   1980
1   7500   2050   2050   1980
2  15450  15050  15550  14900

In [247]:
df2.index=['2024-01-01','2024-02-01','2024-03-01']
df2

                0      1      2      3
2024-01-01   2000   3050   2050   1980
2024-02-01   7500   2050   2050   1980
2024-03-01  15450  15050  15550  14900

In [248]:
df2.columns=['Open','High','Low','Close']
df2

             Open   High    Low  Close
2024-01-01   2000   3050   2050   1980
2024-02-01   7500   2050   2050   1980
2024-03-01  15450  15050  15550  14900

In [249]:
df2.loc['2024-04-01']=[3200,3550,3000,2990]
df2

             Open   High    Low  Close
2024-01-01   2000   3050   2050   1980
2024-02-01   7500   2050   2050   1980
2024-03-01  15450  15050  15550  14900
2024-04-01   3200   3550   3000   2990

In [250]:
df2.drop(['2024-01-01'], inplace=True)

In [251]:
df2.iloc[1][0]=14000
df2

C:\Users\KDP-26\AppData\Local\Temp\ipykernel_11428\501209611.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df2.iloc[1][0]=14000
C:\Users\KDP-26\AppData\Local\Temp\ipykernel_11428\501209611.py:1: FutureWarning: Series.__setitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To set a value by position, use `ser.iloc[pos] = value`
  df2.iloc[1][0]=14000

             Open   High    Low  Close
2024-02-01   7500   2050   2050   1980
2024-03-01  14000  15050  15550  14900
2024-04-01   3200   3550   3000   2990

In [252]:
df2['Average']=0
df2

             Open   High    Low  Close  Average
2024-02-01   7500   2050   2050   1980        0
2024-03-01  14000  15050  15550  14900        0
2024-04-01   3200   3550   3000   2990        0

In [253]:
df2.loc['Total']=0
df2

             Open   High    Low  Close  Average
2024-02-01   7500   2050   2050   1980        0
2024-03-01  14000  15050  15550  14900        0
2024-04-01   3200   3550   3000   2990        0
Total           0      0      0      0        0

3. 아래 단답형 문제에 답해주세요.
 (3-01)  판다스는  (   데이터   
)를 분석하기 위한 패키지입니다.
 (3-02)  판다스에서는 다양한 종류의 데이터를   (  DataFrame       
(3-03)  판다스에서는 1차원 데이터를 저장하는 자료구조를 ( Sereis         
(3-04)  판다스에서는 2차원 데이터를 저장하는 자료구조를 ( DataFrame      
(3-05)  판다스는 내부적으로 데이터를 (   Array   
)형태로 저장합니다.
 )라고 합니다.
 )형태로 저장합니다.
 (3-06)  판다스에서는 1개 열/column 추출 시  자료구조는 (    Sereis          
(3-07)  판다스에서는 1개 행/row 추출 시  자료구조는 (      Sereis         
)라고 합니다.
 )입니다.
 )입니다.
 (3-08)  판다스에서는 2개 이상 열/column 또는 행/row 추출 시  자료구조는 
(       DataFrame       
)입니다